{
  "updatedAt": "2025-11-21T12:00:00.000Z",
  "rating": 5.0,
  "totalReviews": 143,
  "reviews": [
    {
      "author_name": "Davine Heath",
      "rating": 5,
      "text": "Fantastic maths tuition delivered by Alicia. My daughter has responded well to Alicia's teaching style and finds her both approachable and helpful. In just 6 weeks my daughters confidence has grown and her grades have improved and been noticed by school. Im so glad we have taken the leap to get the extra tuition and have sign up for more classes. At first my daughter was worried about the classes being a n online group but she gets so much private time during the sessions with the tutor when needed its put her at ease and works really well. The cost is worth every penny. Nothing is more important than investing in your child's future!.",
      "relative_time_description": "Nov 2025"
    },
    {
      "author_name": "Nichola Adamson",
      "rating": 5,
      "text": "I'm so pleased with how Maths Tutors Online have given my daughter more confidence and ability in her maths. The biggest surprise has been how much she is enjoying the sessions. The tutors are excellent and deliver the information in such an effective way. Alicia and Kevin are a breath of fresh air and have done what I thought was near impossible... made maths enjoyable and understandable for my daughter and we've already seen a grade increase in just 6 weeks, just brilliant ⭐⭐⭐⭐⭐",
      "relative_time_description": "Nov 2025"
    },
    {
      "author_name": "Jayne Finch",
      "rating": 5,
      "text": "At first we were sceptical that this would work but I have been really surprised that it has worked. My daughter has just had her 6 week review and from week 1 to week 6 she has improved so much and we are so glad that we have took plunge and done this for our daughter. We are looking forward to the next 6 weeks to see how much more she improves.We haven’t seen our daughter get this interested in her maths since primary school. Marlon is really good at explain everything and our daughter is thriving in her maths.I would highly recommend Maths Tutors online to anyone whose child is struggling with their maths.",
      "relative_time_description": "Nov 2025"
    }
  ]
}
